# Python Intro - Final Exercise

In [2]:
import pyodbc
import pandas as pd
import numpy as np
print('ok')

ok

In [3]:
### In windows, Using a ODBC DNS (predefined connection name)
conn = pyodbc.connect('DSN=COLLEGE;Trusted_Connection=yes;')

In [4]:
### Get the students table
students = pd.read_sql("SELECT * FROM Students;",conn) 
classrooms = pd.read_sql("SELECT * FROM Classrooms;",conn) 
courses = pd.read_sql("SELECT * FROM Courses;",conn) 
departments = pd.read_sql("SELECT * FROM Departments;",conn) 
teachers = pd.read_sql("SELECT * FROM Teachers;",conn) 

#add another column for join with department table
courses['DepartmentId'] = courses.DepartmentID

data = pd.merge(pd.merge(pd.merge(pd.merge(classrooms, courses, on='CourseId'), 
                                    departments, on='DepartmentId'), 
                           students, on='StudentId'), 
                  teachers, on='TeacherId')

data = data.rename(columns = {'FirstName_x':'StudentFirstName', 
                         'LastName_x': 'StudentLastName',
                        'Gender_x' : 'StudentGender',
                        'FirstName_y':'TeacherFirstName',
                        'LastName_y':'TeaccherLastName',
                        'Gender_y':'TeacherGender'})

# Questions
 
 
## Q1. Count the number of students on each department

In [5]:
print('\nNumber of students : %d' % students.shape[0])

Number of students : 280

## Q2. How many students have each course of the English department and the total number of students in the department?

In [6]:
#total student in each department
res = data[['DepartmentName', 'StudentId']].drop_duplicates().groupby('DepartmentName').agg({'StudentId':['count']})

print("Number of students in all departments is\n", res)

#in english department
res1 = data[['DepartmentName', 'StudentId']].drop_duplicates();
print("Number of students in Engllish depsrtment is", res1[res1.DepartmentName == 'English'].shape[0])


data['CourseNum'] = 0

tt = data[data.DepartmentName == 'English'].groupby('StudentId')['CourseNum'].agg('count')

print ("Number of student that took all the 3 english classes is:", tt[tt==3].shape[0])

Number of students in all departments is
                StudentId
                   count
DepartmentName
Arts                 137
English               84
Science              200
Sport                 81
Number of students in Engllish depsrtment is 84
Number of student that took all the 3 english classes is: 0

## Q3. How many small (<22 students) and large (22+ students) classrooms are needed for the Science department?

In [7]:
data['Res'] = -1 
science_classes = data[data.DepartmentName == 'Science'].groupby('CourseId').Res.agg('count')

print("Number of small classrooms needed for Science Department courses is: ",science_classes[science_classes < 22].shape[0])

print("Number of large classrooms needed for Science Department courses is: ",science_classes[science_classes >= 22].shape[0])

Number of small classrooms needed for Science Department courses is:  6
Number of large classrooms needed for Science Department courses is:  10

## Q4. A feminist student claims that there are more male than female in the College. Justify if the argument is correct

In [10]:
data[['StudentId', 'StudentGender']].drop_duplicates().groupby('StudentGender').agg('count')

               StudentId
StudentGender
F                    153
M                    103

## Q5. For which courses the percentage of male/female students is over 70%?

In [9]:
data.head()

data['Female'] = 0
data['Male'] = 0


data.loc[data.StudentGender == 'F','Female'] = 1
data.loc[data.StudentGender == 'M','Male'] = 1

df = data.groupby('CourseName').agg({'Female':['mean']})
if (df[df > 0.7].dropna().shape[0] > 0 ):
    print("Courses with females more than 70%: \n", df[df > 0.7].dropna())

df = data.groupby('CourseName').agg({'Male':['mean']})
if (df[df > 0.7].dropna().shape[0] > 0 ):
    print("Courses with males more than 70%: \n", df[df > 0.7].dropna())

Courses with females more than 70%:
               Female
                mean
CourseName
Sculpture   0.708333
Tenis       0.722222

## Q6. For each department, how many students passed with a grades over 80?

In [10]:
data.head()

df = data[['DepartmentName', 'StudentId', 'degree']]

df = df[df['degree'] > 80].drop_duplicates()

print("For each department number of students passed with a grade over 80\n", df.groupby('DepartmentName')['StudentId'].agg('count'))

For each department number of students passed with a grade over 80
 DepartmentName
Arts        68
English     43
Science    171
Sport       41
Name: StudentId, dtype: int64

## Q7. For each department, how many students passed with a grades under 60?

In [11]:
data.head()

df = data[['DepartmentName', 'StudentId', 'degree']]

df = df[df['degree'] < 60].drop_duplicates()

print("For each department number of students passed with a grade under 60\n", df.groupby('DepartmentName')['StudentId'].agg('count'))

For each department number of students passed with a grade under 60
 DepartmentName
Arts       3
English    2
Science    7
Sport      1
Name: StudentId, dtype: int64

## Q8. Rate the teachers by their average student's grades (in descending order).

In [12]:
data.head()

print(data.groupby(['TeacherFirstName','TeaccherLastName','TeacherId'])['degree'].agg('mean').sort_values(ascending=False))

TeacherFirstName  TeaccherLastName  TeacherId
 Darick           Hess              22.0         81.432703
 Jordyn           Baron             3.0          80.729494
 Heather          Metcalf           5.0          80.440242
 Zachary          Healy             20.0         79.365867
 Kaylea           Monzingo          1.0          79.365537
 Daniel           Bland             18.0         78.908281
 Keegan           Price             24.0         78.814631
 Conor            Mckittrick        15.0         78.699492
 Maxwell          Romkee            23.0         78.673509
 Terran           Beaty             19.0         78.495479
 Tanner           Fitzsimons        17.0         78.443395
 Mackenzie        Olsen             10.0         78.383348
 Ernest           Stoyanov          21.0         78.316150
 Madison          Batan             6.0          77.743575
 Katerina         Young             9.0          77.406852
 Mikayla          Russell           12.0         77.134323
 Amanda           Dworkin           2.0          76.899881
 Kaitlin          Delude            11.0         76.765296
 Jeffrey          Batzel            14.0         76.737973
 Robert           Aivazian          16.0         76.516464
 Caroline         Knuesel           8.0          75.955453
 Alexander        Watts             13.0         75.668139
Name: degree, dtype: float64

## Q9. Create a dataframe showing the courses, departments they are associated with, the teacher in each course, and the number of students enrolled in the course (for each course, department and teacher show the names).

In [18]:
print(data.groupby(['CourseName','DepartmentName','TeacherFirstName','TeaccherLastName'])['StudentId'].agg('count'))

CourseName            DepartmentName  TeacherFirstName  TeaccherLastName
Advanced English      English          Conor            Mckittrick          24
Algebra               Science          Alexander        Watts               12
Biology               Science          Jordyn           Baron               36
Chemistry             Science          Jeffrey          Batzel              24
Computer Science      Science          Kaylea           Monzingo            38
Data Science          Science          Mackenzie        Olsen               30
English Begginers     English          Conor            Mckittrick          32
Genetics              Science          Terran           Beaty               38
Geometry              Science          Alexander        Watts               14
Gymnastics            Sport            Maxwell          Romkee              24
History of Arts       Arts             Caroline         Knuesel             32
Java                  Science          Darick           Hess                16
Literature            Arts             Daniel           Bland               40
Matematics Advanced   Science          Alexander        Watts               10
Mathematics 101       Science          Amanda           Dworkin             18
Musicology            Arts             Madison          Batan               30
Neurobiology          Science          Terran           Beaty               24
Painting              Arts             Katerina         Young               34
Physics               Science          Alexander        Watts               12
Proffesional English  English          Conor            Mckittrick          38
Python                Science          Terran           Beaty               24
R                     Science          Tanner           Fitzsimons          34
SQL                   Science          Zachary          Healy               24
Sculpture             Arts             Robert           Aivazian            24
Statistics            Science          Heather          Metcalf             24
Swimming              Sport            Mikayla          Russell             18
Tenis                 Sport            Keegan           Price               18
Theater               Arts             Ernest           Stoyanov            26
Volleyball            Sport            Kaitlin          Delude              36
Name: StudentId, dtype: int64

## Q10. Create a dataframe showing the students, the number of courses they take, the average of the grades per department, and their overall average (for each student show the student name).

In [114]:
data.head()
data[data.StudentId == 202]

data['StudentTotalAvg']=0

avg=data.groupby(['StudentId'])['degree'].agg(['mean', 'count']).reset_index()

avg.columns = ['StudentId', 'General_degree', 'NumberOfCourses']

df = data[['StudentId', 'StudentFirstName','StudentLastName', 'DepartmentName', 'degree']]

df = pd.pivot_table(df, values='degree',
                     index=['StudentId', 'StudentFirstName','StudentLastName'],
                     columns='DepartmentName',
                     aggfunc=['mean']).reset_index()

df.columns = ['StudentId', 'StudentFirstName','StudentLastName', 'Arts_degree', 'English_degree', 'Science_degree', 'Sport_degree']

df = pd.merge(avg, df, on='StudentId')

df = df.drop(['StudentId'], axis=1)

cols = df.columns.tolist()

cols = cols[2:] + cols[:2]

df = df[cols]

df

,StudentFirstName,StudentLastName,Arts_degree,English_degree,Science_degree,Sport_degree,General_degree,NumberOfCourses
0,Alexandria,Heller,86.677535,NaN,79.557508,NaN,81.337515,4
1,Cassie,Liska,79.542738,NaN,78.867115,NaN,79.137364,5
2,Hayley,Frank,NaN,83.972245,76.204427,NaN,78.793700,3
3,Maxwell,Kotch,69.356144,70.929801,74.157066,NaN,71.481003,3
4,Dylan,Boehm,64.494845,NaN,100.000000,65.661106,76.718650,3
5,Chelsea,Vuolo,68.799129,NaN,74.358535,NaN,71.578832,2
6,Katrina,Evers,NaN,NaN,73.325298,NaN,73.325298,4
7,Sean,Hasenack,96.216926,89.073972,79.304200,NaN,88.198366,3
8,Madalyn,Miller,NaN,NaN,86.802830,NaN,86.802830,2
9,Katrina,Miller,80.085031,NaN,78.642720,85.120393,80.622716,4
10,Rachael,Williams,70.931227,NaN,75.634056,NaN,72.498837,3
11,Sophiya,Aponte,87.463154,83.145779,61.489085,NaN,78.810949,4
12,Elijah,Hogan,NaN,NaN,65.117226,80.134422,72.625824,2
13,Catherine,Sturgeon,62.078946,NaN,79.498041,67.795261,71.333110,5
14,Anina,Meneses,80.183240,NaN,82.269726,78.507968,80.807665,4
15,Cody,Dawkins,NaN,NaN,77.610780,NaN,77.610780,3
16,Austin,Power,71.874634,82.552181,83.802440,NaN,80.507924,4
17,Devin,Tolstykh,NaN,NaN,81.012028,NaN,81.012028,2
18,Darby,Cobb,77.732135,NaN,88.540484,NaN,83.136309,4
19,Kayla,Cameron,87.347722,NaN,72.290676,73.092297,78.473818,5
20,Alexandrea,Hannafious,NaN,89.626782,NaN,85.638019,86.967607,3
21,Angela,Palermo,83.056965,NaN,NaN,NaN,83.056965,2
22,Sarah,Reilly-Vessey,80.675826,NaN,83.082923,NaN,81.478192,3
23,Morgan,Wikowsky,NaN,NaN,NaN,97.843102,97.843102,1
24,Kyle,Shepler,NaN,89.617024,86.392643,NaN,88.004833,4
25,Shawn,Foster,96.208535,NaN,75.593857,NaN,80.747526,4
26,Mycah,Bingham,NaN,85.842696,76.112900,NaN,77.734532,6
27,Chance,Mcdonough,89.448639,NaN,81.118440,NaN,83.200990,4
28,Kyle,Nibbelink,NaN,75.846171,88.811482,NaN,84.489712,3
29,Chanda,Fillmore,NaN,NaN,NaN,67.974169,67.974169,1
...,...,...,...,...,...,...,...,...
226,Michaela,Anderson,71.087956,NaN,82.392375,NaN,74.856095,3
227,Wyatt,Yeros,60.838903,NaN,76.698833,NaN,71.412190,3
228,Benjamin,Schott,71.987883,NaN,81.507984,58.617007,75.517816,7
229,Robin,Golbus,NaN,NaN,84.065549,73.083079,78.574314,2
230,Heather,Williams,84.511338,80.464086,79.406817,NaN,81.211582,4
231,Kori,Roper,NaN,NaN,77.294996,72.426924,76.321382,5
232,Ruben,Mosher,NaN,93.979918,84.355469,NaN,87.563619,3
233,Victoria,Wert,NaN,NaN,75.884974,NaN,75.884974,1
234,Derrick,Mayberry,NaN,NaN,78.112739,74.077610,77.103957,4
235,Nicholas,Roth,90.245913,NaN,86.460666,NaN,87.217715,5
236,Christian,Boucher,80.377150,84.376073,90.447911,NaN,86.412261,4
237,Taiahbeth,Gerard,78.695946,NaN,NaN,NaN,78.695946,1
238,Samantha,Untiedt,74.231525,NaN,77.161046,NaN,75.696286,2
239,Luke,Van Cleave,NaN,NaN,NaN,78.336991,78.336991,1
240,Kara,Sedlak,69.372437,76.478726,77.299487,NaN,75.549925,5
241,Hannah,Anttila,NaN,NaN,77.499552,NaN,77.499552,3
242,Maria,Gaddis,55.272243,NaN,NaN,84.743844,70.008043,2
243,Catherine,Lemme,NaN,80.612820,83.338550,NaN,82.657117,4
244,Lauren,Salazar,NaN,NaN,78.431908,81.308043,79.869976,2
245,Tyler,Raymond,74.542943,NaN,80.736405,NaN,77.639674,4
246,Brooke,Bishop,72.487410,NaN,82.188336,NaN,77.337873,4
247,Mckayla,Greaser,NaN,NaN,85.886297,91.040974,88.463635,2
248,Jennifer,Smith,69.461506,NaN,89.663116,80.718437,79.947686,3
249,Kenneth,Lemmon,NaN,NaN,73.334264,NaN,73.334264,3
250,Samantha,Anderson,NaN,72.569900,NaN,NaN,72.569900,1
251,Elise,Ohler,94.702880,71.617451,80.897496,NaN,82.028830,4
252,Dylan,Bannister,NaN,NaN,76.784735,NaN,76.784735,3
253,Bryan,Medina,78.849330,NaN,81.298837,NaN,80.482335,6
254,Sydney,Blas,NaN,NaN,72.578017,76.749775,75.359189,3
255,Matthew,Mcgrath,77.237998,NaN,75.696576,NaN,76.621429,5